Tekla Open API Reference for Tekla Structures 2025
Parallel.LineSegmentToPlane Method
Overload List
Name | Description
LineSegmentToPlane(LineSegment, GeometricPlane)
 Returns true if the given line segment and plane are parallel.
LineSegmentToPlane(LineSegment, GeometricPlane, Double)
 Returns true if the given line segment and plane are parallel within the given angular tolerance.
Top
See Also
Reference
Parallel Class
Tekla.Structures.Geometry3d Namespace